# Exercise 4.9 Part 1
# Table of content
## Importing libraries and dataframe
### 1.Checking the frame of the new imported dataframe and wrangling the data
### 2. Data quality and consistency checks
### 3. Uploading ords_prods dataframe and combining it with customers dataframe 
### 4. Exporting the new combined datafram to pickle format

## Importing libraries and dataframe

In [13]:
# Importing libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [15]:
# Importing path

path = r'C:\Users\salmi\Desktop\Projects\Achievement 4\Instacart Basket Analysis'

In [131]:
# Importing data set customers as a new dataframe

customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [93]:
# Importing ords_prods dataframe
ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_clean_no_outliers.pkl'))

### 1.Checking the frame of the new imported dataframe and wrangling the data

In [133]:
# Checking the variables on the dataframe

customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [135]:
customers.shape

(206209, 10)

In [137]:
customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [139]:
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

#### Wrangling data: changing datatypes, renaming columns and deleting columns

In [142]:
# Changing the datatype of the columnn user_id

customers[['user_id']] = customers [['user_id']].astype(str)

In [144]:
# Renaming columns age, gender and state

customers.rename(columns={'Age': 'age', 'STATE': 'state', 'Gender' : 'gender'}, inplace=True)

#### !!! For data privacy concerns of our customers, the columns first name and surname will be dropped from this analysis

In [146]:
# Dropping the columns

customers.drop(['First Name', 'Surnam'], axis=1, inplace=True)

In [122]:
customers.head()

,user_id,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [148]:
customers.dtypes

user_id         object
gender          object
state           object
age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

### 2. Data quality and consistency checks

In [150]:
# Checking for mix data types in every column

for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

##### --> The dataframe does not have any mixed datatype in its remaining columns

In [153]:
# Checking for missing values in the customers dataframe

customers.isnull().sum()

user_id         0
gender          0
state           0
age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

##### --> The dataframe does not have any missing values

In [156]:
# Checking for duplicates

customers.duplicated().sum()

0

##### --> The dataframe does not have any duplicates

### 3. Uploading ords_prods dataframe and combining it with customers dataframe

#### Checks on the ords_prods dataframe

In [160]:
ords_prods.head()

,order_id,user_id,order_amount,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,prices,price_range_loc,busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_spend,spender_flag,customer frequency,frequency flag
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,9.0,Mid-range product,Regularly busy,Average orders,10,New customer,6.367797,Low_spender,20.5,Non-frequent customer
1,2539329,1,1,2,8,NaN,14084,2,0,Organic Unsweetened Vanilla Almond Milk,...,12.5,Mid-range product,Regularly busy,Average orders,10,New customer,6.367797,Low_spender,20.5,Non-frequent customer
2,2539329,1,1,2,8,NaN,12427,3,0,Original Beef Jerky,...,4.4,Low-range product,Regularly busy,Average orders,10,New customer,6.367797,Low_spender,20.5,Non-frequent customer
3,2539329,1,1,2,8,NaN,26088,4,0,Aged White Cheddar Popcorn,...,4.7,Low-range product,Regularly busy,Average orders,10,New customer,6.367797,Low_spender,20.5,Non-frequent customer
4,2539329,1,1,2,8,NaN,26405,5,0,XL Pick-A-Size Paper Towel Rolls,...,1.0,Low-range product,Regularly busy,Average orders,10,New customer,6.367797,Low_spender,20.5,Non-frequent customer

In [178]:
#Checking for outliers
ords_prods['prices'].max()

25.0

In [172]:
ords_prods.shape

(32404859, 22)

In [176]:
customers.shape

(206209, 8)

In [180]:
# Checking datatypes for ords_prods
ords_prods.dtypes

order_id                   object
user_id                    object
order_amount                int64
orders_day_of_week         object
order_hour_of_day          object
days_since_prior_order    float64
product_id                 object
add_to_cart_order           int64
reordered                   int64
product_name               object
aisle_id                   object
department_id              object
prices                    float64
price_range_loc            object
busiest_days               object
busiest_period_of_day      object
max_order                   int64
loyalty_flag               object
average_spend             float64
spender_flag               object
customer frequency        float64
frequency flag             object
dtype: object

In [184]:
# Searching for common column
customers.columns

Index(['user_id', 'gender', 'state', 'age', 'date_joined', 'n_dependants',
       'fam_status', 'income'],
      dtype='object')

In [186]:
ords_prods.columns

Index(['order_id', 'user_id', 'order_amount', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'product_id',
       'add_to_cart_order', 'reordered', 'product_name', 'aisle_id',
       'department_id', 'prices', 'price_range_loc', 'busiest_days',
       'busiest_period_of_day', 'max_order', 'loyalty_flag', 'average_spend',
       'spender_flag', 'customer frequency', 'frequency flag'],
      dtype='object')

##### ---> ords_prods and customers have the column user_id in common

In [195]:
# Checking if customers user_id is same datatype as in ords_prods

customers.dtypes

user_id         object
gender          object
state           object
age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

##### ---> The dataframes will be merge then on the user_id column

#### Merging the 2 dataframes into ords_prods_cust

In [208]:
ords_prods_cust = customers.merge(ords_prods, on = 'user_id', indicator = True)

In [214]:
# Checking that all the rows have been merged

ords_prods_cust['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [218]:
# Checking for the shape of the new dataframe
ords_prods_cust.head()

,user_id,gender,state,age,date_joined,n_dependants,fam_status,income,order_id,order_amount,...,price_range_loc,busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_spend,spender_flag,customer frequency,frequency flag,_merge
0,26711,Female,Missouri,48,1/1/2017,3,married,165665,518967,1,...,Low-range product,Regularly busy,Most orders,8,New customer,7.988889,Low_spender,19.0,Regular-frequent customer,both
1,26711,Female,Missouri,48,1/1/2017,3,married,165665,423547,2,...,Mid-range product,Regularly busy,Most orders,8,New customer,7.988889,Low_spender,19.0,Regular-frequent customer,both
2,26711,Female,Missouri,48,1/1/2017,3,married,165665,2524893,3,...,Mid-range product,Least busy,Most orders,8,New customer,7.988889,Low_spender,19.0,Regular-frequent customer,both
3,26711,Female,Missouri,48,1/1/2017,3,married,165665,2524893,3,...,Low-range product,Least busy,Most orders,8,New customer,7.988889,Low_spender,19.0,Regular-frequent customer,both
4,26711,Female,Missouri,48,1/1/2017,3,married,165665,2524893,3,...,Mid-range product,Least busy,Most orders,8,New customer,7.988889,Low_spender,19.0,Regular-frequent customer,both

In [220]:
ords_prods_cust.shape

(32404859, 30)

In [222]:
ords_prods_cust.dtypes

user_id                     object
gender                      object
state                       object
age                          int64
date_joined                 object
n_dependants                 int64
fam_status                  object
income                       int64
order_id                    object
order_amount                 int64
orders_day_of_week          object
order_hour_of_day           object
days_since_prior_order     float64
product_id                  object
add_to_cart_order            int64
reordered                    int64
product_name                object
aisle_id                    object
department_id               object
prices                     float64
price_range_loc             object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
average_spend              float64
spender_flag                object
customer frequency         float64
frequency flag              object
_merge                    category
dtype: object

### 4. Exporting the new combined datafram to pickle format

In [234]:
ords_prods_cust.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_cust_all_merged.pkl'))